/**
 *    author: A K M S Limon
 *    created: 30-June-2023  15:54:46
**/
#include <bits/stdc++.h>
using namespace std;

int main() {
    /*একটা ১০^৫ লেন্থ অ্যারে দেওয়া আছে । সেই অ্যারে এর প্রত্যেকটা ইলিমেন্ট ১০^৫ সাইজের । টোটাল অ্যারে এর লসাগু বের
    করতে হবে । লসাগু অনেক বড় হতে পারে । তাই এটাকে মোড করতে হবে k দিয়ে*/

    /*এক সিরিয়ালি লসাগু করে করে মোড করে গেলে ভুল হবে কারণ লসাগু তো মোড এর এই প্রোপার্টি মানে না ।
    তাই একটা অ্যারে বানাতে হবে । সেখানে প্রত্যেকটা প্রাইম নাম্বার মাক্সিমাম কত বার আছে একটা নাম্বার এ সেটা স্টোর
    করতে হবে । তারপর এই প্রাইম নাম্বর গুলা গুন করে করে মোড করলে লসাগু পাওয়া যাবে । */
    
      
    return 0;
}